### Plan for staging
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition
🔴 Delete aws_dynamodb_table.ab_test_participants
🔴 Delete aws_dynamodb_table.ab_tests

**0 to add, 0 to modify, 1 to replace, 2 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # aws_dynamodb_table.ab_test_participants will be destroyed
  # (because aws_dynamodb_table.ab_test_participants is not in configuration)
  - resource "aws_dynamodb_table" "ab_test_participants" {
      - arn                         = "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_test_participants" -> null
      - billing_mode                = "PAY_PER_REQUEST" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "resourceId" -> null
      - id                          = "ab_test_participants" -> null
      - name                        = "ab_test_participants" -> null
      - range_key                   = "testName" -> null
      - read_capacity               = 0 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {
          - "Terraform"  = "true"
          - "table_name" = "ab_test_participants"
          - "team"       = "multi-product"
        } -> null
      - tags_all                    = {
          - "Terraform"      = "true"
          - "product"        = "multi"
          - "product_region" = "uk"
          - "service_name"   = "ab-testing"
          - "table_name"     = "ab_test_participants"
          - "team"           = "multi-product"
        } -> null
      - write_capacity              = 0 -> null

      - attribute {
          - name = "resourceId" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "testName" -> null
          - type = "N" -> null
        }

      - point_in_time_recovery {
          - enabled = true -> null
        }

      - server_side_encryption {
          - enabled = true -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # aws_dynamodb_table.ab_tests will be destroyed
  # (because aws_dynamodb_table.ab_tests is not in configuration)
  - resource "aws_dynamodb_table" "ab_tests" {
      - arn                         = "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_tests" -> null
      - billing_mode                = "PAY_PER_REQUEST" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "testName" -> null
      - id                          = "ab_tests" -> null
      - name                        = "ab_tests" -> null
      - range_key                   = "version" -> null
      - read_capacity               = 0 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {
          - "Terraform"  = "true"
          - "table_name" = "ab_tests"
          - "team"       = "multi-product"
        } -> null
      - tags_all                    = {
          - "Terraform"      = "true"
          - "product"        = "multi"
          - "product_region" = "uk"
          - "service_name"   = "ab-testing"
          - "table_name"     = "ab_tests"
          - "team"           = "multi-product"
        } -> null
      - write_capacity              = 0 -> null

      - attribute {
          - name = "testName" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "version" -> null
          - type = "N" -> null
        }

      - point_in_time_recovery {
          - enabled = true -> null
        }

      - server_side_encryption {
          - enabled = true -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.3-4" -> "0.0.4-12"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.3-4" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.4-12"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.3-4" -> "0.0.4-12"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.3-4" -> "0.0.4-12"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: staging.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "staging.plan"

```
</details>